In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/laxmimerit/All-CSV-ML-Data-Files-Download/refs/heads/master/titanic.csv")

In [3]:
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [7]:
df1 = pd.read_html("data/d1.html")

In [9]:
df1

[    ID         Full Name  Username                         Email  \
 0    1      Aarav Sharma   aarav_s      aarav.sharma@example.com
 1    2        Diya Verma    diya_v        diya.verma@example.com
 2    3       Kabir Singh   kabir_s       kabir.singh@example.com
 3    4      Ananya Gupta  ananya_g      ananya.gupta@example.com
 4    5       Rohan Mehta   rohan_m       rohan.mehta@example.com
 5    6       Ishita Nair  ishita_n       ishita.nair@example.com
 6    7        Vikram Rao  vikram_r        vikram.rao@example.com
 7    8        Meera Iyer   meera_i        meera.iyer@example.com
 8    9      Aditya Joshi  aditya_j      aditya.joshi@example.com
 9   10         Sara Khan    sara_k         sara.khan@example.com
 10  11        Neel Patel    neel_p        neel.patel@example.com
 11  12         Pooja Das   pooja_d         pooja.das@example.com
 12  13       Arjun Reddy   arjun_r       arjun.reddy@example.com
 13  14      Naina Kapoor   naina_k      naina.kapoor@example.com
 14  15        Harsh Jain   harsh_j        harsh.jain@example.com
 15  16    Tanvi Kulkarni   tanvi_k    tanvi.kulkarni@example.com
 16  17      Mohit Bansal   mohit_b      mohit.bansal@example.com
 17  18       Simran Kaur  simran_k       simran.kaur@example.com
 18  19       Ritika Bose  ritika_b       ritika.bose@example.com
 19  20     Yash Malhotra    yash_m     yash.malhotra@example.com
 20  21          Alia Roy    alia_r          alia.roy@example.com
 21  22         Ayaan Ali   ayaan_a         ayaan.ali@example.com
 22  23       Priya Menon   priya_m       priya.menon@example.com
 23  24  Manav Chatterjee   manav_c  manav.chatterjee@example.com
 24  25          Ira Sood     ira_s          ira.sood@example.com
 25  26     Devika Pillai  devika_p     devika.pillai@example.com
 26  27       Rahul Yadav   rahul_y       rahul.yadav@example.com
 27  28         Sneha Rao   sneha_r         sneha.rao@example.com
 28  29    Karan Malhotra   karan_m    karan.malhotra@example.com
 29  30     Zoya Siddiqui    zoya_s     zoya.siddiqui@example.com

               Phone                City             State Country  \
 0   +91-90000-00001               Delhi             Delhi   India
 1   +91-90000-00002              Mumbai       Maharashtra   India
 2   +91-90000-00003           Bengaluru         Karnataka   India
 3   +91-90000-00004                Pune       Maharashtra   India
 4   +91-90000-00005           Ahmedabad           Gujarat   India
 5   +91-90000-00006               Kochi            Kerala   India
 6   +91-90000-00007           Hyderabad         Telangana   India
 7   +91-90000-00008             Chennai        Tamil Nadu   India
 8   +91-90000-00009              Jaipur         Rajasthan   India
 9   +91-90000-00010             Kolkata       West Bengal   India
 10  +91-90000-00011               Surat           Gujarat   India
 11  +91-90000-00012            Guwahati             Assam   India
 12  +91-90000-00013          Vijayawada    Andhra Pradesh   India
 13  +91-90000-00014             Lucknow     Uttar Pradesh   India
 14  +91-90000-00015              Indore    Madhya Pradesh   India
 15  +91-90000-00016              Nagpur       Maharashtra   India
 16  +91-90000-00017               Noida     Uttar Pradesh   India
 17  +91-90000-00018             Patiala            Punjab   India
 18  +91-90000-00019              Bhopal    Madhya Pradesh   India
 19  +91-90000-00020          Chandigarh        Chandigarh   India
 20  +91-90000-00021            Siliguri       West Bengal   India
 21  +91-90000-00022              Kanpur     Uttar Pradesh   India
 22  +91-90000-00023  Thiruvananthapuram            Kerala   India
 23  +91-90000-00024             Kolkata       West Bengal   India
 24  +91-90000-00025              Shimla  Himachal Pradesh   India
 25  +91-90000-00026          Coimbatore        Tamil Nadu   India
 26  +91-90000-00027            Varanasi     Uttar Pradesh   India
 27  +91-90000-00028              Mysuru         Karnataka   India
 28  +91-90000-00029            Amritsar            Punjab   India
 29  +91-90000-00030              Ranchi         Jharkhand   India

      Department              Role   Salary   Join Date    Status  Rating  \
 0   Engineering       Backend Dev  1200000  2023-04-10    Active     4.6
 1        Design             UI/UX   900000  2022-11-02    Active     4.4
 2   Engineering      Frontend Dev  1100000  2021-07-19    Active     4.2
 3            HR        HR Manager   950000  2020-01-15    Active     4.7
 4         Sales        Sales Lead  1050000  2019-09-03    Active     4.1
 5       Support       Support Eng   650000  2023-09-28    Active     4.3
 6   Engineering            DevOps  1300000  2022-03-11    Active     4.5
 7       Finance           Analyst   800000  2021-02-06    Active     4.0
 8     Marketing               SEO   700000  2020-06-21    Active     3.9
 9         Legal         Associate   980000  2018-12-10    Active     4.4
 10  Engineering       QA Engineer   750000  2022-08-25    Active     4.2
 11      Support         Team Lead   880000  2020-10-05    Active     4.6
 12  Engineering     Data Engineer  1400000  2021-05-14    Active     4.5
 13    Marketing           Content   680000  2023-01-09    Active     4.1
 14        Sales      Account Exec   920000  2019-03-27  Inactive     3.7
 15      Finance        Controller  1250000  2017-07-01    Active     4.8
 16  Engineering         Architect  2200000  2016-09-12    Active     4.9
 17           HR         Recruiter   620000  2022-04-04    Active     4.0
 18       Design       Illustrator   730000  2021-11-30    Active     4.2
 19  Engineering        Mobile Dev  1500000  2020-08-17    Active     4.3
 20      Support       Support Eng   600000  2023-06-12    Active     3.8
 21    Marketing    Ads Specialist   780000  2022-02-18    Active     4.0
 22  Engineering       ML Engineer  1700000  2021-09-08    Active     4.6
 23        Sales         Sales Ops   860000  2019-11-09    Active     4.1
 24      Finance        Accountant   720000  2020-04-29  Inactive     3.6
 25       Design  Product Designer  1150000  2022-06-23    Active     4.5
 26  Engineering      Security Eng  1600000  2021-03-03    Active     4.4
 27      Support           Quality   640000  2023-03-19    Active     4.1
 28  Engineering       Systems Eng  1180000  2018-05-15    Active     4.2
 29        Legal        Compliance   990000  2019-01-22    Active     4.3

           Last Login
 0   2026-02-04 10:21
 1   2026-02-03 19:05
 2   2026-02-04 09:12
 3   2026-02-01 16:44
 4   2026-02-02 08:30
 5   2026-02-04 11:02
 6   2026-02-04 07:55
 7   2026-02-02 14:18
 8   2026-02-03 12:40
 9   2026-01-30 09:33
 10  2026-02-04 12:11
 11  2026-02-03 21:09
 12  2026-02-04 08:06
 13  2026-02-04 06:58
 14  2025-12-18 17:20
 15  2026-02-01 10:03
 16  2026-02-04 11:40
 17  2026-02-03 09:10
 18  2026-02-04 10:48
 19  2026-02-04 09:59
 20  2026-02-04 12:02
 21  2026-02-03 18:50
 22  2026-02-04 08:44
 23  2026-02-02 20:22
 24  2025-10-01 09:12
 25  2026-02-04 10:05
 26  2026-02-04 11:13
 27  2026-02-04 09:27
 28  2026-02-03 15:31
 29  2026-02-01 18:07  ]

In [10]:
df3 = pd.read_json("data/d2.json")

In [11]:
df3.head(3)

,title,generated_on,students
0,Mini Student Data,2026-02-04,"{'id': 1, 'name': 'Aarav Sharma', 'cgpa': 8.2,..."
1,Mini Student Data,2026-02-04,"{'id': 2, 'name': 'Diya Verma', 'cgpa': 6.1, '..."
2,Mini Student Data,2026-02-04,"{'id': 3, 'name': 'Kabir Singh', 'cgpa': 7.5, ..."

In [14]:
df.to_csv("data/d4.csv", index=None, sep="|")

In [18]:
df = pd.read_csv("data/d4.csv", sep="|")

In [19]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [20]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='str')

In [22]:
df.columns = [x.lower() for x in df.columns]

In [23]:
df.head(1)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [24]:
x = df[["age", "pclass"]]

In [25]:
x

      age  pclass
0    22.0       3
1    38.0       1
2    26.0       3
3    35.0       1
4    35.0       3
..    ...     ...
886  27.0       2
887  19.0       1
888   NaN       3
889  26.0       1
890  32.0       3

[891 rows x 2 columns]

In [26]:
df["name"] = [x.lower() for x in df["name"]]

In [27]:
df.head(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,1,0,3,"braund, mr. owen harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"cumings, mrs. john bradley (florence briggs th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"heikkinen, miss. laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"futrelle, mrs. jacques heath (lily may peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"allen, mr. william henry",male,35.0,0,0,373450,8.0500,NaN,S

In [28]:
df["family_size"] = df["sibsp"] + df["parch"]

In [29]:
df.head(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,family_size
0,1,0,3,"braund, mr. owen harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"cumings, mrs. john bradley (florence briggs th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,"heikkinen, miss. laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,"futrelle, mrs. jacques heath (lily may peel)",female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,"allen, mr. william henry",male,35.0,0,0,373450,8.0500,NaN,S,0

In [30]:
df["fair_per_person"] = df["fare"] / (df["family_size"]+1)

In [31]:
df.head(3)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,family_size,fair_per_person
0,1,0,3,"braund, mr. owen harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,3.62500
1,2,1,1,"cumings, mrs. john bradley (florence briggs th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,35.64165
2,3,1,3,"heikkinen, miss. laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,7.92500

In [33]:
df.head(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,family_size,fair_per_person
0,1,0,3,"braund, mr. owen harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,3.62500
1,2,1,1,"cumings, mrs. john bradley (florence briggs th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,35.64165
2,3,1,3,"heikkinen, miss. laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,7.92500
3,4,1,1,"futrelle, mrs. jacques heath (lily may peel)",female,35.0,1,0,113803,53.1000,C123,S,1,26.55000
4,5,0,3,"allen, mr. william henry",male,35.0,0,0,373450,8.0500,NaN,S,0,8.05000

In [36]:
df["alone"] = df["family_size"].apply(lambda x: False if x > 0 else True)

In [37]:
df.head(5)

,passengerid,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,family_size,fair_per_person,alone
0,1,0,3,"braund, mr. owen harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1,3.62500,False
1,2,1,1,"cumings, mrs. john bradley (florence briggs th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1,35.64165,False
2,3,1,3,"heikkinen, miss. laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,7.92500,True
3,4,1,1,"futrelle, mrs. jacques heath (lily may peel)",female,35.0,1,0,113803,53.1000,C123,S,1,26.55000,False
4,5,0,3,"allen, mr. william henry",male,35.0,0,0,373450,8.0500,NaN,S,0,8.05000,True